app/views/gossips/edit.html.erb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
		<br />
		<input type="hidden" name="user" value=<%= User.first.id %>>