app/views/gossips/index.html.erb

SELECT "gossips".* FROM "gossips"
---
<div class="grid">
  <% Gossip.all.each do |gossip| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
---
      <div class="card-body text-dark">
        <h5 class="card-title"><%= gossip.user.first_name %> <%= gossip.user.last_name %></h5>