app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
---
    <div class="container">
        <h1 class="display-3"><%= @gossip.user.first_name %> <%= @gossip.user.last_name %></h1>