app/views/pages/city.html.erb

      <div class="card-body text-dark">
        <h5 class="card-title"><%= gossip.user.first_name %> <%= gossip.user.last_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]