app/controllers/gossips_controller.rb

  def create
    @gossip = Gossip.new(title: params[:title], content: params[:content], user_id: current_user.id)

    if @gossip.save
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "cvvfbsfb"], ["content", " fdfbdfbdfbdfbf"], ["user_id", 21], ["created_at", "2020-02-12 15:45:05.799024"], ["updated_at", "2020-02-12 15:45:05.799024"]]

  def update
    @gossip = Gossip.find(params[:id])
    if @gossip.user.id == current_user.id
      if @gossip.update(title: params[:title], content: params[:content])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "test\r\n"], ["updated_at", "2020-02-13 18:54:29.942249"], ["id", 22]]

  def destroy
    @gossip = Gossip.find(params[:id])
    if @gossip.user.id == current_user.id
      if @gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 37]]