app/controllers/pages_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"
---
  def city
    @gossips = []
    @city = City.find(params[:id])
    Gossip.all.each do |gossip|