app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 20]]
---
    def show
        @user = User.find(params[:id])
        @author_gossips = @user.gossips.all

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ezkndfkndvds@gmail.com"], ["LIMIT", 1]]
SELECT "cities".* FROM "cities"
INSERT INTO "users" ("first_name", "last_name", "email", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @user = User.new(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], password: params[:password], city_id: City.all.sample.id)

        if @user.save