app/views/layouts/application.html.erb

          </li>
          <% if User.find_by(id: session[:user_id]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]